

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	//EDT 1.8.0.808 не добавляет на форму реквизит дерева значений с типом "ТаблицаЗначений"
	ТаблицаПараметров = Элементы.Добавить("ТаблицаПараметров", Тип("ТаблицаФормы"), Элементы.ТекущийКод);
	ТаблицаПараметров.ПутьКДанным = "Элементы.ДеревоКода.ТекущиеДанные.ПараметрыКода";
	
	ПолеТаблицы = Элементы.Добавить("ПараметрКода", Тип("ПолеФормы"), ТаблицаПараметров);
	ПолеТаблицы.ПутьКДанным ="Элементы.ДеревоКода.ТекущиеДанные.ПараметрыКода.Параметр";
	ПолеТаблицы.Вид = ВидПоляФормы.ПолеВвода; 
	
	ПолеТаблицы = Элементы.Добавить("ЗначениеПараметраКода", Тип("ПолеФормы"), ТаблицаПараметров);
	ПолеТаблицы.ПутьКДанным ="Элементы.ДеревоКода.ТекущиеДанные.ПараметрыКода.Значение";
	ПолеТаблицы.Вид = ВидПоляФормы.ПолеВвода; 
		
КонецПроцедуры
