

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	//EDT 1.8.0.808 не добавляет на форму реквизит дерева значений с типом "ТаблицаЗначений"
	ТаблицаПараметров = Элементы.Добавить("ТаблицаПараметров", Тип("ТаблицаФормы"), Элементы.ТекущийКод);
	ТаблицаПараметров.ПутьКДанным = "Элементы.ДеревоКода.ТекущиеДанные.ПараметрыКода";
	
	ПолеТаблицы = Элементы.Добавить("ПараметрКода", Тип("ПолеФормы"), ТаблицаПараметров);
	ПолеТаблицы.ПутьКДанным ="Элементы.ДеревоКода.ТекущиеДанные.ПараметрыКода.Параметр";
	ПолеТаблицы.Вид = ВидПоляФормы.ПолеВвода; 
	
	ПолеТаблицы = Элементы.Добавить("ЗначениеПараметраКода", Тип("ПолеФормы"), ТаблицаПараметров);
	ПолеТаблицы.ПутьКДанным ="Элементы.ДеревоКода.ТекущиеДанные.ПараметрыКода.Значение";
	ПолеТаблицы.Вид = ВидПоляФормы.ПолеВвода; 
		
КонецПроцедуры


&НаКлиенте
Процедура ВыполнитьКодНаКлиенте(Команда)

	ПараметрыКода = ПодготовитьКод(Элементы.ДеревоКода.ТекущиеДанные);
	Если НЕ ПараметрыКода = Неопределено Тогда
		Выполнить(ПараметрыКода.Код);
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьКодНаСервере(Команда)

	ПараметрыКода = ПодготовитьКод(Элементы.ДеревоКода.ТекущиеДанные);
	Если НЕ ПараметрыКода = Неопределено Тогда
		ВыполнитьКодНаСервереВызовСервера(ПараметрыКода);
	КонецЕсли;

КонецПроцедуры

&НаСервереБезКонтекста
Процедура ВыполнитьКодНаСервереВызовСервера(ПараметрыКода)

	Выполнить(ПараметрыКода.Код);

КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Функция ПодготовитьКод(ДанныеВыполнения)
	
	Если ПустаяСтрока(ДанныеВыполнения.Код) Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	ЗначенияПараметров = Новый Массив;	
	ИнициализацияПараметров = "";

	Для Каждого ДанныеПараметра Из ДанныеВыполнения.ПараметрыКода Цикл
		ЗначенияПараметров.Добавить(ДанныеПараметра.Значение);	
		ИнициализацияПараметров = ИнициализацияПараметров + ДанныеПараметра.Параметр + 
		" = ПараметрыКода.ЗначенияПараметров[" + ЗначенияПараметров.ВГраница() + "];";	
	КонецЦикла;
	
	ПараметрыКода = Новый Структура("Код, ЗначенияПараметров", 
	ИнициализацияПараметров + ДанныеВыполнения.Код, ЗначенияПараметров);					

	Возврат ПараметрыКода;
	
КонецФункции